app/Controllers/Product.php

SELECT *
FROM `branches`
---
    public function index()
    {
        // return view('product_list');
        $data['branches'] = $this->branchModel->findAll();