app/Models/ProductModel.php

    public function getProductsByBranch($branchId)
    {
        if ($branchId) {
            return $this->where('branch_id', $branchId)->findAll();
        } else {
            return $this->findAll();
---
SELECT *
FROM `products`
WHERE `branch_id` = '1'
SELECT *
FROM `products`